Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions
Contains optional filters for listing and searching for models.
Options can be used to filter models by access level, name, schema version, state, tags, type, view, and organization ID.
Corresponds to the GetModelsParams in Structural Data Product API.

Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions.AccessLevel
Optional. Filters models by access level.
Valid values: "read", "write", "admin".
Case sensitive.

Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions.Name
Optional. Filters models by name.

Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions.SchemaVersion
Optional. Filters models by schema version.

Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions.State
Optional. Filters models by state.
If value is "deleted", models that have been marked as deleted but not yet deleted will be included.

Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions.Tags
Optional. Filters models by tags.

Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions.Type
Optional. Filters models by type.

Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions.View
Optional. Filters models by view.
If values is "my", only models created by the user will be returned.

Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions.OrganizationId
Optional. Filters models by organization ID.